{
  "data": {
    "items": [
      {
        "companies": [
          {
            "created": 1692465328542942000,
            "placeCountryId": "us",
            "uniqueId": "netwarestudio",
            "updated": 1692465328542942000,
            "workCountryId": "ir"
          },
          {
            "created": 1692465328542942000,
            "placeCountryId": "ir",
            "uniqueId": "pordoweb",
            "updated": 1692465328542942000,
            "workCountryId": "ir"
          }
        ],
        "created": 1692465328541921000,
        "createdFormatted": "2023/08/19 19:15:28",
        "projects": [
          {
            "created": 1692465328542382000,
            "description": "A visual time picker for angular 2+ projects. You can use this timepicker with Angular 2, 4, 5, 6, 7 and Angular Material. This project doesn't require angular material or any other dependencies. Very challenging project, mostly because of third party compatibilities, answering pull request, issues on github, and try to make it usable for as many as users possible.",
            "title": "Amazing TimePicker",
            "uniqueId": "amazing_time_picker",
            "updated": 1692465328542382000
          },
          {
            "created": 1692465328542382000,
            "description": "ArcGis Dashboard tool is a proprietary web application used for understanding, and navigating through GIS based information exported through different sources, such as govermental boundries, water areas, historical locations, and helps users to understand what kind of limitation applies to an specific area of interest.\nLarge amount of data in different formats, such as geojson, and shapefiles were stored in the database and SPA interface helps clients to pick those necessary, check the versioning and many more.\nIn this project I was getting help from a UX designer at first, but later I had to built things by myself and also manage the product user journy by taking steer in refinement meetings.",
            "end": 1690848000000000,
            "start": 1682812800000000,
            "technicalDescription": "Software fully built on top of Next.js using react, scss styling and a glassi theme in the beginning. Soon after few sprints, I've realised that there are two problems:\n* Software should run without a server, so I did convert the next.js to craco, and also due to having specific urls with dynamic Unique ids, I could not use the static exporting.\n* The final client introduced their own design system, which I had to use those components as much as possible. This thing itself took a long shot, due to webcomponents used in the project, and react wrapper was not that up-to-date.\nThe usage of react-query library was a huge help indeed, which helped to manage the errors, timeouts  and some layer of caching. In this project I have introduced common archive, single component manager.\nInstead of google maps, I had to use the ArcGIS javascript library. ArcGIS has different approach to maps, it's more useful in GIS heavy environments. The map in the center of screen, was mainly used for selecting area of interests, and it had to be done by various methods: Draw a polygon, Draw a rectangle, import shapefile, import geojson. I've worked a bit in depth with drawing tools, layers, cleaning layers, prevent overlapping areas, and spent adequet time learning ArcGIS documentations.\nFor the uploading geojson file and shapefiles, I provided two methods, first by choosing a file dialog, and second by dragging file in case you are in the map screen. I have implemented a dragzone,  which every component can listen two, and as many as handlers could be there to accept file by desired types.\nAuthentication used in this project was MSAL integration. Msal with react itself is a bit a challenge, also I understood that deeply in the azure configuration there are undocumented differences between 'Webapp' and 'SPA'. Took me few days of debugging for correct refresh token, signin, signout behavior.",
            "title": "ArcGis dashboard tool",
            "uniqueId": "arcgis_react_js_tool",
            "updated": 1692465328542382000
          },
          {
            "created": 1692465328542382000,
            "description": "React go dashboard (commercial demo name) or more precisely \"Fireback\", is a set of modules, codebase, framework which tends to help developer (originally developed for myself to build faster for clients) build long lasting, extremly performant, reliable software which runs on every platform, such as: Android, IOS, Wide webservers (Ubuntu, Windows, MIPS) Desktop applications, and microcontrollers, such as ESP32 from espressif.\nThe goal is, to build independent software from SaaS providers, which can run fully offline, can be hosted on premise or cloud, makes possible to collaborate, having full authentication flow, and standard requests, responses, query dsl all out of the box.\nAfter many years of developing, I had realised so many basic features, such as pagination, search, sorting, configurating database, logging, importing, exporting data, and many more, are usually missing in most of products. Poor UI, missing keyboard functionalities, heavy front-ends, or uncompiled source code on server side seemed to me a big problem in order to deliver high quality products. To answer all these I have created fireback, and as a demo, react go dashboard.\nWhen building a project on Fireback, you define most of the work in yaml configurations, and fireback code generator creates many functions required for those entities, create, edit, delete, advance query, searching, accessing them using CLI, GRPC, HTTP, permission system.\nFrom a backend perspective, project can be running monolith, or as microservice. It's very lightweight, as low as 8MB for linux servers on a mid size project, and does not depend on any external library, and does not need a docker to make sure it's running since there will be no requirement as such.\nFrom a front-end side, a full size project weights less than 800KB, and 300KB on first load, on a full size project, including mocks for testing, icons and so. It's so low in weight that I have embedded the UI directly into ESP32 chips which only can contain 4MB of flash memory.\nOn the mobile side, the same backend, and front-end can bundle into the cordova, and generate APK or IPA for Android and IOS Platforms. Backend can be removed from mobile, in case the app is fully running on cloud, and no extra code is needed. Backend is managed in a way which can save all the data on SQLite as well, without extra configuration other than specifying it's gonna run on a mobile device.\nOn the desktop side, it provides Linux, Windows, and Mac binaries, with or without backend, as low as 20MB for a full size project with backend. Having similar situation on mobile, it can work in many different setups and scenarios.\nDue to minimal usage of the external libraries in front-end, not only the UI is light, but also is fast, and MacOSX theme proves how near such apps can get to the native UI appearance just with CSS, including light and dark mode.\nReact go dashboard or Fireback, can also produce a lot of C code, such as entities and http routes, and give a lot of boilerplate for products which need to run on microcontrollers or low memory environments.",
            "start": 1643500800000000,
            "technicalDescription": "React Go Dashboard (Fireback) is written in Golang, C, JavaScript (React), TypeScript and SCSS, with some scripts.\nProject consists of main parts, called `cmd`, `core` and `modules`. In a Fireback project, we do not have such thing as one project, but rather, there are many modules, such as workspaces, roles, users, payment, which could combine inside a `cmd` folder, and generate a new product, for specific ARCH or operating system.\nFor example, when we are running app A on desktop, we omit workspaces library to some level, and do not  include the payment module in the binary because it just does not make sense when running offline, and on the cloud, they are very well included.\n## Backend part (Golang) \nis very well organized, it's based on relational database, mainly SQLite or MySQL, and heavily depends on entity concept. For every entity, Fireback creates:\n- CLI options, to create entities, get one, delete, bulk update, export or export to csv, json, yaml - When creating an entity, you can include other entities as child, single, array, object or many2many - Advanced validation on the entity, or on children. - Create sub entities (other modules which are child here), also update them on patch. - HTTP Requests, get, query with pagination, sorting, filters by each column - Mock system for entities, as well as seeder to contain the initial data of the project. For example, if you have a gender entity, you can define them in a yaml file, and system puts them into the database when starting. - GRPC Support for all actions. - Permissions being created and added to the system. All entities work under workspace, role and user, so there are no specific code or config required. Every content is bound to the current workspace. - Advanced translation system for entity, separate for each column on database. Fireback translates queries or getItemById upon sending accept-language in headers via GRPC, HTTP or CLI. - Migration codes in the database. - Proto definition files, both for automatic generated code and developer defined code.\n## Thirdparty SDKs, JavaScript, React.js\nFireback modules, all are exported to the JavaScript sdk, and React.js sdk. This feature is one of the pioneer options that helps front-end developers to use backend directly in their source code, instead of writing fetch, or http call codes, managing state, error handling, error messages, they would just call the exported functions, and underlying sdk (auto generated) would handle it for them.\nWith this feature not only we make coding faster, but also it's more clearer, since all the definition of request and responses are also included. It would remove the necessity of checking documents and intelisense would suggest fields, and possible responses directly into the IDE. Plus, if a feature is not supported by backend anymore, it would be compiler error on front-end to include those functions and it reduces the out of sync issues between backend and front-end to zero.\n## File uploads\nOne of the large issues which has been solved by Golang community and hence Fireback, is file upload. It has embedded the TUS upload framework, which allows reliable uploading, resumable uploads out of the box. In the front-end and as well as SDK, react hooks and JavaScript functions for uploading multiple files are provided. Drive module, handles the file uploads and after storing the uploaded content on the disk, Drive creates a record in File entities table, with all information of the owner, user created, file size and many more. All files are available both on download mode, and inline mode. Some minor work has been done for coverting files in the backend also but it's not major.\n## Packaging of the server side\nMajor target products now run on cloud hosting, and React go dashboard also generates Windows Server, Ubuntu Server, and even Mac Server binaries, and they all come with installers. All binaries both work with MySQL and SQLite, therefor front-end developers can install their own version of the backend, and if the project provides mocks, they would run the mocks and can start developing without the requirement of installing backend tools, such as Docker, heavy Java environments and many more. Initializing and configuration of the product comes with CLI, by calling `fireback init` it would ask the database credentials, the ports http server, and file server will be lifted, and creates `project-configuration.yml` on that directory. This easily allows for multiple environments on any project.\n## Front-end: React.js\nFireback also has a UI project, which is a react.js app, could be built either with Next.js or craco based on project need. It follows the backend API Response/Request structure, and contains a lof of ready to use components inside of it. Front-end does not force any libraries to be used, neither does not uses itself, other than react and few utilities. Entire style system is pure css (SCSS preprocessor) and comes with automatic/dark/light MacOSX theme. Theme system could be extended, and does not rely on JavaScript at all.\nProduct aims to be super light, without components entire build folder weights less than 250KB, and 820KB on a test with full modules and components on a microcontroller chip.\nFront-end also follows a multi target architecture, developer can build multiple products out of same source code, again without any external libraries, or monorepo, etc.\n\nAll these happens just by defining entities structure in the Module2.yml files",
            "title": "React go dashboard (Fireback core)",
            "uniqueId": "fireback",
            "updated": 1692465328542382000
          },
          {
            "created": 1692465328542382000,
            "description": "Software aims to give a management system for house associations, specially those neighbourhoods which owned by a company or, a house owner that has multiple houses or manages the rental for the owners. As a team leader in this project, I had to build the major components of the app, lists, filters etc, api calls, forms, form validations and etc. Based on my role, I had direct contact with the client, and daily meeting with business analysts with developers to ensure everything was on the track, and I would report to delivery manager as well.\nAll of the fearures inside the app, are categorized by 3 sections (roles) inside the system:\n- Homeowners - Managers - Vendors.\n## Homeowners Home owners are people who basically own a house, might add several houses, giving the exact house location, area.\n## Manager Managers are people who are having a vote in the association board, they can accept requests such as repair, violations or committee voting\n## Vendors Vendors are the most limited people in the system, they only complete work order requests\n\n## Main features of the app\n### Accounting Solution contains a small accounting system, with the option to download the invoices, see the transactions, approve payments, etc It gives the software an option to set the payment method to stripe or wire transfer, by giving each payment method information Homeowners and vendors also can specifiy their bank account information, for management to use them for payments.\n### Document Center All documents across the system are accessible via Document Center, where users can delete, browse, check history of all the documents and files which has been shared between them. They could be downloaded, and PDF/Images could be seen inside app in a modal for ease of access.\n### Work Order This feature is a major one and important across the all roles, homeowners or managers can request a work order to be done. Work orders can be different types, such as repair, cutting grass, replace wires, and many more. Each request could be approved by a committee of managers, and then assigned to an specific vendor.\n### Violation Report Homeowners are able to report a violation to the association, such as wrong parking, damaging visual appreance of the block, or other kind of disrupting behavior.\n## Authentication system\nThe authentication was done using email or phone number, after you login in to your account, system checks how many roles are assigned to you, and if there is more than one, you can select that role. After selecting, you would be moved to your default screen. App does not provide a dashboard, but rather different archive component depending on the user role type.\nBeyond react-native app, there is a react.js app on the web version, mostly focused on the manager part, which had all of the features in the app before hand. I had to look at the API most of the time on the web version and replicate the functions on react native side.",
            "end": 1680825600000000,
            "start": 1653091200000000,
            "technicalDescription": "Project was written in React Native, and there was extensive usage of the redux. Before I take over the leadership, project was  going for 3 months and barely 2 screens were ready.\nAs the first step, I begin to polish existing screens, and simplified the development flow. It took me long time and few weeks of over hour work to put some practises inside, including:\n- More standard API calls, moving http calls into hooks - Fix the visual apperance of the software, margin, padding, which seems easy but in fact damaged the product vastly. - Implement error handling for submiting forms, single pages, lists - Create a general archive (flast list) screen, which was used by 80% of all lists inside the app. - Create an advanced filtering component which worked correctly with lists, could be modified per requirement of specific business scenario, opened a modal, as well as showing the selected condition under the page title. - Reliable page title, and page actions. In fact it seems to be a simple thing, but it took a notable time to replace all screens page title with their main actions with a general component to prevent disorientation and flickering when screens were changed.",
            "title": "Self-Management Solutions for Homeowner’s Association Mobile Application",
            "uniqueId": "home_owner_association",
            "updated": 1692465328542382000
          },
          {
            "created": 1692465328542382000,
            "description": "● In SEEK various programming projects challenge their employees. As a full- stack developer, daily tasks include upgrading and tuning existing code bases and refactor codes; also updating dependencies and monitoring deployment processes. Using industry standard  AWS services, such as EC2, Elasticache, RDS, etc. are exciting parts of the role. ● One of the most challenging matters of SEEK and their subsidiaries is deploying the same codebase  through multiple targets, countries and cultures. This helps examine real world application of programming skills. This is where real TDD comes into play. Facing AI solutions for managing  large-scale traffic of applications and working with data scientists is a glorious opportunity. ● The biggest legacy of SEEK goes beyond the technical; it delves into the multicultural working environment. Working with skilled co-workers from all backgrounds teaches valuable lessons beyond technical borders; our work extends to how to be a true team player, involvement in all  aspects of a project and earning your team's trust from inception of an idea to the delivered product.",
            "title": "Job Portal Career Path",
            "uniqueId": "job_portal",
            "updated": 1692465328542382000
          },
          {
            "created": 1692465328542382000,
            "description": "Compete for glory in automated sports experiences, tournaments, brackets, network with others, host tournaments, create and join teams, squad up in your favorite games. Find events, leagues, tournaments, brackets. App is using extensive graphical animations and elements using css, canvas and lottie. As a user, you could signup and join/host tournaments in different game, the most favorable was pubg. I spent a lot of long hours with co-founder to validate designs, implement the user journeys App used ngrx store, an main logic of the app was unit tested but overall was depending on manual testing. The backend written in node.js, MySQL, Express framework. Linking games, moving back and forth from the app, and implementing webhooks in games to handle the changes in the scores, finishing rounds of games, all were really unique to this specific project. Many effects were unavailable in css, such as moving countdown in specific format, which caused me to write a lot of pure canvas code in order to achieve the desired game effect. This one also was one of the unique projects, which I have integrated sound effects, and be involved a lot with the AppStore/GPlay compliance section due to nature of the product.",
            "title": "Mobile Game Leaderboard Ionic Application",
            "uniqueId": "leaderboard_app",
            "updated": 1692465328542382000
          },
          {
            "created": 1692465328542382000,
            "description": "MiniFirma, is a discontinued mobile application which main purpose was to facilitate creating invoices and taking legal papers and store them in one place. Technology: React Native Platforms: IOS, Android Status: MVP only, discontinued due to lack of enough development funds ● Build the entire app from scratch, ● Use custom designed charts in the app ● Use SQLlite inside the app, to store the information ● Use camera module, to take pictures of invoices ● Manage the business information, to create digital business card",
            "title": "Minifirma Accounting app",
            "uniqueId": "minifirma",
            "updated": 1692465328542382000
          },
          {
            "created": 1692465328542382000,
            "description": "As the main React.js developer in one of network management softwares, which was used to monitor the latency of internet network between nodes, mainly used in Japan, I have followed responsibilities such as: ● Interactive maps using D3 maps, allowing users to zoom in and out, pan, and interact with various elements on the map to see the network speed on the map. ● Design real time heatmap of data flow across the United States, and Japan. ● Implement google time series API in the front-end, to query the internet speed over time on different nodes ● Create complex forms, using formik, in order to save the configuration, background listeners, and files ● Conduct code reviews to ensure quality and maintainability of the React.js codebase. ● Work with the QA team to ensure that React.js applications are properly tested, most of the tests written in cypress testing framework ● Implement most of the actions in React-Redux, plus rxjs for realtime changes and apply the results into the stores",
            "title": "Senior React.js Developer for Network Management App",
            "uniqueId": "network_management_app",
            "updated": 1692465328542382000
          },
          {
            "created": 1692465328542382000,
            "description": "My main role was to develop the core of multi-purpose template, to complete more projects by fewer man-power and shorter time. By reusing code and concepts for each project. Our theme, \"_tkpersian\" was inspired by open source \"underscore\" project, with lots of localized components and sugar code for developing with long-term support perspective. Netware has been invested on \"Smart home\" solutions, comparable to IoT (Internet of things) concept. After I joined, we were focus on both hardware and software design, to access devices over local network and Internet. My role was to create the software full-stack solutions, like creating dashboard administrator, user privileges, managing devices, etc. It's worthwhile to mention I got lot's of experience with working on embedded devices, and writing/fabricating their drives to connect with computer.",
            "title": "Ovio IOT Platform",
            "uniqueId": "ovio_iot_platform",
            "updated": 1692465328542382000
          },
          {
            "created": 1692465328542382000,
            "description": "Pordo Company was a tremendous experience for me. I learned lot's of things both about programming and about working, as a professional. Company main project was a \"Dedicated\" content management system, literally called \"PordoCMS\". After I joined the company as \"Junior programmer\", not so long after that we started a Re-write of the CMS to become to more reliable solution. On Pordo I was responsible for backend mostly, and worked with other people and collect their work result, to deploy it on servers. After a while, we added a small CRM solution, aiming to facilitate internal process of companies and managing their orders, bills, and personnels. Approximately my time spent more than 1 year working on a \"B2B\" business solution, which was store in store online market. I created both front-end scripts, form builders for products, searching mechanism based by product type, and a huge chunk of corresponding backend on PHP. It's normal to write more complex MySQL queries to optimized and query a B2B solution, for reporting, finding products, comparison of products. Based on this B2B solution, two projects started called \"Intachi\" and \"30t4u\", which only 30t4u lasts to work.",
            "title": "PordoWeb CMS",
            "uniqueId": "pordoweb",
            "updated": 1692465328542382000
          },
          {
            "created": 1692465328542382000,
            "description": "As a senior React Native developer, I participated into the building solar panel commissioning and usage monitoring app, for household purposes ● Build the navigation system and project structure ● Bind the UI to backend, and visualize the the information about charge controller incoming/outgoing electricity charge ● Build Interactive charts using D3 and react-native-svg, using the calculation from the d3 library and bind it to the svg module to make it usable in the phone environment ● Build user onboarding flow, complex wizards, to add user panels, definite their charge controller (MPPT) and battery bank ● Build different targets, and make the app whitelabel for IOS and Android ● Write the hardware data interchange in goalng ● Develop sync mechanism, to keep the device configuration both on the hardware and system backend written in golang ● Implement the monitoring system, error reporting third party libraries, and adding push notifications from charging device",
            "title": "Solar System Charge controller",
            "uniqueId": "solar_system_charge_controller",
            "updated": 1692465328542382000
          },
          {
            "created": 1692465328542382000,
            "description": "Teamtelefon is a product to help people for to organize and distribute the medical calls, and ensure that there is always someone to take the call. As a senior React Native Engineer, I worked on the product: ● Create the list of available people ● Build entire mechanism of creating user availability, write complex calculation algorithms to split user availability, prevent time collision ● Create a full user phonebook system, and synchronize it with phone native contacts list ● Make the notifications coming using fireback, event and trigger system to notify people before their shifts ● User settings panel ● Write the backend in the firebase toolset, serverless mechanism ● Used real-time database for storing the information",
            "title": "Telefony team management React Native app",
            "uniqueId": "telefony",
            "updated": 1692465328542382000
          }
        ],
        "translations": [
          {
            "languageId": "fa",
            "linkerId": "ada569a6"
          }
        ],
        "uniqueId": "ada569a6",
        "updated": 1692465328541921000,
        "userId": "",
        "workspaceId": ""
      }
    ],
    "itemsPerPage": 9999,
    "startIndex": 0,
    "totalItems": 1
  }
}